yorange1/OneOS-Lite/drivers/hal/mm32/sdk/MM32SPIN0XX_HAL/MM32SPIN0x/Include/MM32SPIN0x.h
#define  ADCR_TRGSEL_TIM1_CC1              ((uint32_t)0x00000000)               /*!<TIM1_CC1 as trig source*/
#define  ADCR_TRGSEL_TIM1_CC2              ((uint32_t)0x00000010)               /*!<TIM1_CC2 as trig source*/
#define  ADCR_TRGSEL_TIM1_CC3              ((uint32_t)0x00000020)               /*!<TIM1_CC3 as trig source*/
#define  ADCR_TRGSEL_TIM2_CC2              ((uint32_t)0x00000030)               /*!<TIM2_CC2 as trig source*/
#define  ADCR_TRGSEL_TIM3_TRGO             ((uint32_t)0x00000040)               /*!<TIM3_TRGO as trig source*/
#define  ADCR_TRGSEL_TIM3_CC1              ((uint32_t)0x00000060)               /*!<TIM3_CC1 as trig source*/
#define  ADCR_TRGSEL_EXTI_11               ((uint32_t)0x00000070)               /*!<EXTI_11 as trig source*/

#define  ADCR_ADST                         ((uint32_t)0x00000100)               /*!<ADC start convert data */   

#define  ADCR_ADMD			     		   ((uint32_t)0x00000600)               /*!<ADC convert mode */  
#define  ADCR_ADMD_0			     	   ((uint32_t)0x00000200)               /*!<Bit 0 */  
#define  ADCR_ADMD_1			     	   ((uint32_t)0x00000400)               /*!<Bit 1 */  

#define  ADCR_ADMD_SINGLE                  ((uint32_t)0x00000000)               /*!<ADC single convert mode */  
#define  ADCR_ADMD_PERIOD                  ((uint32_t)0x00000200)               /*!<ADC single period convert mode */ 
#define  ADCR_ADMD_CONTINUE                ((uint32_t)0x00000400)               /*!<ADC continue scan convert mode */ 

#define  ADCR_ALIGN                   	   ((uint32_t)0x00000800)               /*!<ADC data alignment */ 
#define  ADCR_ALIGN_LEFT                   ((uint32_t)0x00000800)               /*!<ADC data left align */ 
#define  ADCR_ALIGN_RIGHT                  ((uint32_t)0x00000000)               /*!<ADC data right align */ 

#define  ADCR_CMPCH                        ((uint32_t)0x0000F000)               /*!<CMPCH[15:12] ADC window compare channel0 convert data */  
#define  ADCR_CMPCH_0                      ((uint32_t)0x00001000)               /*!<Bit 0 */  
#define  ADCR_CMPCH_1                      ((uint32_t)0x00002000)               /*!<Bit 1 */  
#define  ADCR_CMPCH_2                      ((uint32_t)0x00004000)               /*!<Bit 2 */  
#define  ADCR_CMPCH_3                      ((uint32_t)0x00008000)               /*!<Bit 3 */ 
                    
/********************  Bit definition for ADCHS register  ********************/  
#define  ADCHS_CHEN                        ((uint32_t)0x0000C3FF)               /*!<ADC channel select */  				
#define  ADCHS_CHEN0                       ((uint32_t)0x00000001)               /*!<ADC channel0 enable */    
#define  ADCHS_CHEN1                       ((uint32_t)0x00000002)               /*!<ADC channel1 enable */   
#define  ADCHS_CHEN2                       ((uint32_t)0x00000004)               /*!<ADC channel2 enable */   
#define  ADCHS_CHEN3                       ((uint32_t)0x00000008)               /*!<ADC channel3 enable */   
#define  ADCHS_CHEN4                       ((uint32_t)0x00000010)               /*!<ADC channel4 enable */   
#define  ADCHS_CHEN5                       ((uint32_t)0x00000020)               /*!<ADC channel5 enable */   
#define  ADCHS_CHEN6                       ((uint32_t)0x00000040)               /*!<ADC channel6 enable */   
#define  ADCHS_CHEN7                       ((uint32_t)0x00000080)               /*!<ADC channel7 enable */   
#define  ADCHS_CHEN8                       ((uint32_t)0x00000100)               /*!<ADC channel8 enable */ 
#define  ADCHS_CHEN9                       ((uint32_t)0x00000200)               /*!<ADC channel9 enable */ 
#define  ADCHS_CHENTS                      ((uint32_t)0x00004000)               /*!<ADC sensor enable */   
#define  ADCHS_CHENVS                      ((uint32_t)0x00008000)               /*!<ADC sensor enable */   

/********************  Bit definition for ADCMPR register  ********************/                       
#define  ADCMPR_CMPLDATA                   ((uint32_t)0x00000FFF)               /*!<ADC 12bit window compare DOWN LEVEL DATA*/     
#define  ADCMPR_CMPHDATA                   ((uint32_t)0x0FFF0000)               /*!<ADC 12bit window compare UP LEVEL DATA*/                                              

/********************  Bit definition for ADSTA register  ********************/                          
#define  ADSTA_ADIF                        ((uint32_t)0x00000001)               /*!<ADC convert complete flag*/                     
#define  ADSTA_ADWIF                       ((uint32_t)0x00000002)               /*!<ADC compare flag*/                     
#define  ADSTA_BUSY                        ((uint32_t)0x00000004)               /*!<ADC busy flag*/                     
#define  ADSTA_CHANNEL                     ((uint32_t)0x000000F0)               /*!<CHANNEL[7:4] ADC current channel*/                     
#define  ADSTA_CHANNEL_0                   ((uint32_t)0x00000010)               /*!<Bit 0 */
#define  ADSTA_CHANNEL_1                   ((uint32_t)0x00000020)               /*!<Bit 1*/
#define  ADSTA_CHANNEL_2                   ((uint32_t)0x00000040)               /*!<Bit 2*/
#define  ADSTA_CHANNEL_3                   ((uint32_t)0x00000080)               /*!<Bit 3*/
#define  ADSTA_CHANNEL_CH0           	   ((uint32_t)0x00000000)               /*!<Channel 0 */
#define  ADSTA_CHANNEL_CH1                 ((uint32_t)0x00000010)               /*!<Channel 1*/
#define  ADSTA_CHANNEL_CH2                 ((uint32_t)0x00000020)               /*!<Channel 2*/
#define  ADSTA_CHANNEL_CH3                 ((uint32_t)0x00000030)               /*!<Channel 3*/
#define  ADSTA_CHANNEL_CH4                 ((uint32_t)0x00000040)               /*!<Channel 4 */
#define  ADSTA_CHANNEL_CH5                 ((uint32_t)0x00000050)               /*!<Channel 5*/
#define  ADSTA_CHANNEL_CH6                 ((uint32_t)0x00000060)               /*!<Channel 6*/
#define  ADSTA_CHANNEL_CH7                 ((uint32_t)0x00000070)               /*!<Channel 7*/
#define  ADSTA_CHANNEL_CH8                 ((uint32_t)0x00000080)               /*!<Channel 8 */
#define  ADSTA_CHANNEL_CH9                 ((uint32_t)0x00000090)               /*!<Channel 9*/
#define  ADSTA_CHANNEL_CH10                ((uint32_t)0x000000A0)               /*!<Channel 10*/
#define  ADSTA_CHANNEL_CH11                ((uint32_t)0x000000B0)               /*!<Channel 11*/
#define  ADSTA_CHANNEL_CH12          	   ((uint32_t)0x000000C0)               /*!<Channel 12*/
#define  ADSTA_CHANNEL_CH13           	   ((uint32_t)0x000000D0)               /*!<Channel 13*/
#define  ADSTA_CHANNEL_CH14           	   ((uint32_t)0x000000E0)               /*!<Channel 14*/
#define  ADSTA_CHANNEL_CH15        	       ((uint32_t)0x000000F0)               /*!<Channel 15*/


#define  ADSTA_VALID                       ((uint32_t)0x000FFF00)               /*!<VALID[19:8] ADC channel0 valid flag*/
#define  ADSTA_VALID_0                     ((uint32_t)0x00000100)               /*!<Bit 0*/
#define  ADSTA_VALID_1                     ((uint32_t)0x00000200)               /*!<Bit 1*/
#define  ADSTA_VALID_2                     ((uint32_t)0x00000400)               /*!<Bit 2*/
#define  ADSTA_VALID_3                     ((uint32_t)0x00000800)               /*!<Bit 3*/
#define  ADSTA_VALID_4                     ((uint32_t)0x00001000)               /*!<Bit 4*/
#define  ADSTA_VALID_5                     ((uint32_t)0x00002000)               /*!<Bit 5*/
#define  ADSTA_VALID_6                     ((uint32_t)0x00004000)               /*!<Bit 6*/
#define  ADSTA_VALID_7                     ((uint32_t)0x00008000)               /*!<Bit 7*/
#define  ADSTA_VALID_8                     ((uint32_t)0x00010000)               /*!<Bit 8*/
#define  ADSTA_VALID_9                     ((uint32_t)0x00020000)               /*!<Bit 9*/
#define  ADSTA_VALID_10                    ((uint32_t)0x00040000)               /*!<Bit 10*/
#define  ADSTA_VALID_11                    ((uint32_t)0x00080000)               /*!<Bit 11*/

#define  ADSTA_OVERRUN                     ((uint32_t)0xFFF00000)               /*!<OVERRUN[31:20] ADC channel0 data covered flag*/
#define  ADSTA_OVERRUN_0                   ((uint32_t)0x00100000)               /*!<Bit 0*/
#define  ADSTA_OVERRUN_1                   ((uint32_t)0x00200000)               /*!<Bit 1*/
#define  ADSTA_OVERRUN_2                   ((uint32_t)0x00400000)               /*!<Bit 2*/
#define  ADSTA_OVERRUN_3                   ((uint32_t)0x00800000)               /*!<Bit 3*/
#define  ADSTA_OVERRUN_4                   ((uint32_t)0x01000000)               /*!<Bit 4*/
#define  ADSTA_OVERRUN_5                   ((uint32_t)0x02000000)               /*!<Bit 5*/
#define  ADSTA_OVERRUN_6                   ((uint32_t)0x04000000)               /*!<Bit 6*/
#define  ADSTA_OVERRUN_7                   ((uint32_t)0x08000000)               /*!<Bit 7*/
#define  ADSTA_OVERRUN_8                   ((uint32_t)0x10000000)               /*!<Bit 8*/  
#define  ADSTA_OVERRUN_9                   ((uint32_t)0x20000000)               /*!<Bit 9*/  
#define  ADSTA_OVERRUN_10                  ((uint32_t)0x40000000)               /*!<Bit 10*/
#define  ADSTA_OVERRUN_11                  ((uint32_t)0x80000000)               /*!<Bit 11*/

/********************  Bit definition for ADDR0~ADDR9 register  ********************/
#define  ADDR_DATA                         ((uint32_t)0x0000FFFF)               /*!<ADC channel convert data */
#define  ADDR_OVERRUN                      ((uint32_t)0x00100000)               /*!<ADC data covered flag */
#define  ADDR_VALID                        ((uint32_t)0x00200000)               /*!<ADC data valid flag*/

/******************************************************************************/
/*                                                                            */
/*                                   COMP                                     */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for COMP_CSR register  *******************/
#define  COMP_CSR_EN                         	 ((uint32_t)0x00000001)  		/*!<Comparator x enable*/	

#define  COMP_CSR_MODE                       	 ((uint32_t)0x0000000C)			/*!<Comparator x enable*/	
#define  COMP_CSR_MODE_0                     	 ((uint32_t)0x00000004)			/*!<Bit 0*/
#define  COMP_CSR_MODE_1                     	 ((uint32_t)0x00000008) 		/*!<Bit 1*/

#define  COMP_CSR_MODE_LOWESTPOWER           	 ((uint32_t)0x00000000)			/*!<Comparator lowest power mode*/
#define  COMP_CSR_MODE_LOWPOWER              	 ((uint32_t)0x00000004)			/*!<Comparator low power mode*/
#define  COMP_CSR_MODE_MEDIUMRATE            	 ((uint32_t)0x00000008)			/*!<Comparator medium rate mode*/
#define  COMP_CSR_MODE_HIGHRATE              	 ((uint32_t)0x0000000C)			/*!<Comparator high rate mode*/
      
