yorange1/OneOS-Lite/drivers/hal/mm32/sdk/MM32SPIN0XX_HAL/MM32SPIN0x/Include/MM32SPIN0x.h
#define  COMP_CSR_INM_SEL                    	 ((uint32_t)0x00000070)      	/*!<Comparator x inverting input selection*/
#define  COMP_CSR_INM_SEL_0                  	 ((uint32_t)0x00000010)  		/*!<Bit 0*/
#define  COMP_CSR_INM_SEL_1                  	 ((uint32_t)0x00000020)  		/*!<Bit 1*/
#define  COMP_CSR_INM_SEL_2                  	 ((uint32_t)0x00000040) 		/*!<Bit 2*/

#define  COMP_CSR_INM_SEL_VREFINT_1_4        	 ((uint32_t)0x00000000)  		/*!<Vrefint 1/4 as Compx inverting input*/
#define  COMP_CSR_INM_SEL_VREFINT_1_2        	 ((uint32_t)0x00000010)  		/*!<Vrefint 1/2 as Compx inverting input*/
#define  COMP_CSR_INM_SEL_VREFINT_3_4        	 ((uint32_t)0x00000020)  		/*!<Vrefint 3/4 as Compx inverting input*/
#define  COMP_CSR_INM_SEL_VREFINT            	 ((uint32_t)0x00000030)  		/*!<Vrefint 1 as Compx inverting input*/
#define  COMP_CSR_INM_SEL_INM4               	 ((uint32_t)0x00000040)  		/*!<INM4 as Compx inverting input*/
#define  COMP_CSR_INM_SEL_INM5               	 ((uint32_t)0x00000050)  		/*!<INM5 as Compx inverting input*/
#define  COMP_CSR_INM_SEL_INM6                	 ((uint32_t)0x00000060)  		/*!<INM6 as Compx inverting input*/
#define  COMP_CSR_INM_SEL_INM7                	 ((uint32_t)0x00000070)  		/*!<INM7 as Compx inverting input*/

#define  COMP_CSR_INP_SEL                     	 ((uint32_t)0x00000380)			/*!<Comparator x normal phase input selection*/
#define  COMP_CSR_INP_SEL_0                   	 ((uint32_t)0x00000080) 		/*!<Bit 0*/
#define  COMP_CSR_INP_SEL_1                  	 ((uint32_t)0x00000100) 		/*!<Bit 1*/
#define  COMP_CSR_INP_SEL_2                  	 ((uint32_t)0x00000200)   		/*!<Bit 2*/

#define  COMP_CSR_INP_SEL_INP0               	 ((uint32_t)0x00000000)  		/*!<INP0  as Compx normal phase input*/
#define  COMP_CSR_INP_SEL_INP1             	     ((uint32_t)0x00000080)  		/*!<INP1  as Compx normal phase input*/
#define  COMP_CSR_INP_SEL_INP2               	 ((uint32_t)0x00000100)  		/*!<INP2  as Compx normal phase input*/
#define  COMP_CSR_INP_SEL_INP3               	 ((uint32_t)0x00000180)  		/*!<INP3  as Compx normal phase input*/
#define  COMP_CSR_INP_SEL_INP4                	 ((uint32_t)0x00000200)  		/*!<INP4  as Compx normal phase input*/
#define  COMP_CSR_INP_SEL_INP5               	 ((uint32_t)0x00000280)  		/*!<INP5  as Compx normal phase input*/
#define  COMP_CSR_INP_SEL_INP6               	 ((uint32_t)0x00000300)  		/*!<INP6  as Compx normal phase input*/
#define  COMP_CSR_INP_SEL_INP7                   ((uint32_t)0x00000380)  		/*!<INP7  as Compx normal phase input*/
 
#define  COMP_CSR_OUT_SEL                    	 ((uint32_t)0x00003C00) 			/*!<Comparator x output selection*/
#define  COMP_CSR_OUT_SEL_0                  	 ((uint32_t)0x00000400)			/*!<Bit 0*/
#define  COMP_CSR_OUT_SEL_1                  	 ((uint32_t)0x00000800)			/*!<Bit 1*/
#define  COMP_CSR_OUT_SEL_2                  	 ((uint32_t)0x00001000)			/*!<Bit 2*/
#define  COMP_CSR_OUT_SEL_3                  	 ((uint32_t)0x00002000)			/*!<Bit 3*/

#define  COMP_CSR_OUT_SEL_TIMER1_BRAKEINPUT      ((uint32_t)0x00000800)			/*!<Timer1 brake input*/
#define  COMP_CSR_OUT_SEL_TIMER1_OCREFCLEAR      ((uint32_t)0x00001800)			/*!<Timer1 ocrefclear input*/
#define  COMP_CSR_OUT_SEL_TIMER1_INPUTCAPTURE1   ((uint32_t)0x00001C00)			/*!<Timer1 input capture 1*/
#define  COMP_CSR_OUT_SEL_TIMER2_INPUTCAPTURE4   ((uint32_t)0x00004000)			/*!<Timer1 input capture 4*/
#define  COMP_CSR_OUT_SEL_TIMER2_OCREFCLEAR      ((uint32_t)0x00004400)			/*!<Timer1 ocrefclear input*/
#define  COMP_CSR_OUT_SEL_TIMER3_INPUTCAPTURE1   ((uint32_t)0x00002800)			/*!<Timer1 input capture 1*/
#define  COMP_CSR_OUT_SEL_TIMER3_OCREFCLEAR      ((uint32_t)0x00002C00)			/*!<Timer1 ocrefclear input*/
 
#define  COMP_CSR_POL                         	 ((uint32_t)0x00008000)			/*!<Comparator x output polarity*/

#define  COMP_CSR_HYST                       	 ((uint32_t)0x00030000) 		/*!<Comparator x hysteresis*/
#define  COMP_CSR_HYST_0                     	 ((uint32_t)0x00010000) 		/*!<Bit 0*/
#define  COMP_CSR_HYST_1                     	 ((uint32_t)0x00020000) 		/*!<Bit 1*/

#define  COMP_CSR_HYST_0MILLIVOLT             	((uint32_t)0x00000000) 			/*!<0mV*/
#define  COMP_CSR_HYST_9MILLIVOLT             	((uint32_t)0x00010000) 			/*!<9mV*/
#define  COMP_CSR_HYST_18MILLIVOLT            	((uint32_t)0x00020000) 			/*!<18mV*/
#define  COMP_CSR_HYST_27MILLIVOLT              ((uint32_t)0x00030000) 			/*!<27mV*/

#define  COMP_CSR_OUT                         	((uint32_t)0x40000000)			/*!<Comparator x lock*/
#define  COMP_CSR_LOCK                        	((uint32_t)0x80000000)			/*!<Comparator lock*/

/******************************************************************************/
/*                                                                            */
/*                               Timers (TIM)                                 */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for TIM_CR1 register  ********************/
#define  TIM_CR1_CEN                         ((uint16_t)0x0001)            /*!<Counter enable */
#define  TIM_CR1_UDIS                        ((uint16_t)0x0002)            /*!<Update disable */
#define  TIM_CR1_URS                         ((uint16_t)0x0004)            /*!<Update request source */
#define  TIM_CR1_OPM                         ((uint16_t)0x0008)            /*!<One pulse mode */
#define  TIM_CR1_DIR                         ((uint16_t)0x0010)            /*!<Direction */

#define  TIM_CR1_CMS                         ((uint16_t)0x0060)            /*!<CMS[1:0] bits (Center-aligned mode selection) */
#define  TIM_CR1_CMS_0                       ((uint16_t)0x0020)            /*!<Bit 0 */
#define  TIM_CR1_CMS_1                       ((uint16_t)0x0040)            /*!<Bit 1 */

#define  TIM_CR1_ARPE                        ((uint16_t)0x0080)            /*!<Auto-reload preload enable */

#define  TIM_CR1_CKD                         ((uint16_t)0x0300)            /*!<CKD[1:0] bits (clock division) */
#define  TIM_CR1_CKD_0                       ((uint16_t)0x0100)            /*!<Bit 0 */
#define  TIM_CR1_CKD_1                       ((uint16_t)0x0200)            /*!<Bit 1 */

